RIET/src/Documents/СписаниеОборудования/СписаниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеОборудования</name>
  <registerRecords>AccumulationRegister.ОборудованиеDSS</registerRecords>
  <registerRecords>AccumulationRegister.MaterialsAndSupplies</registerRecords>
  <registerRecords>AccumulationRegister.Оборудование</registerRecords>
  <registerRecords>AccumulationRegister.CoGS</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеЛокальное</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеЭкспорт</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроводкаДеталейСКП</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>РО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Декларации</name>
    <attributes>
      <name>Декларация</name>
      <type>
        <types>DocumentRef.Декларации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиГТД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураИмпорт</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountingUnit</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>PO</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AssetCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Инвойс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеDSS</name>
    <attributes>
      <name>ПроводкаДеталейСКП</name>
      <type>
        <types>DocumentRef.ПроводкаDSS</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ОборудованиеDSS/ОборудованиеDSS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеDSS</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроводкаДеталейСКП</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/MaterialsAndSupplies/MaterialsAndSupplies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>MaterialsAndSupplies</name>
  <resources>
    <name>FiscalSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ManagementSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроводкаДеталейСКП</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.РаспределениеИмпортаПоЗакрытиюПоставки</types>
      <types>DocumentRef.СчетКнигиПокупок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/CoGS/CoGS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>CoGS</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FiscalSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ManagementSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписаниеОборудования</name>
    <type>
      <types>DocumentRef.СписаниеОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроводкаДеталейСКП</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ОборудованиеЛокальное/ОборудованиеЛокальное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеЛокальное</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Оборудование</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Декларация</name>
    <type>
      <types>DocumentRef.Декларации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураИмпорт</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ОборудованиеЭкспорт/ОборудованиеЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеЭкспорт</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Декларация</name>
    <type>
      <types>DocumentRef.Декларации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураИмпорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Enums/ВидыОперацийСписаниеОборудования/ВидыОперацийСписаниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСписаниеОборудования</name>
  <enumValues>
    <name>ОборудованиеЛокальное</name>
  </enumValues>
  <enumValues>
    <name>ОборудованиеЭкспортное</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОборудованиеDSS</name>
  </enumValues>
  <enumValues>
    <name>ReclassFAtoMnS</name>
  </enumValues>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>ReclassFAtoCoS</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/СписаниеОборудования/ObjectModule.bsl
//Добавил РГ-Софт - Пронин Иван
Перем мУдалятьДвижения;
//Конец добавления

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Добавил РГ-Софт - Пронин Иван
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	//Конец добавления
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.ОборудованиеDSS Тогда
		Для Каждого СтрокаТЧ Из ОборудованиеDSS Цикл
			Движение = Движения.ОборудованиеDSS.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
		КонецЦикла;
		Движение = Движения.ОборудованиеDSS.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.ПроводкаДеталейСКП = ПроводкаДеталейСКП;
		Движение.Сумма = ОборудованиеDSS.Итог("Сумма");
		Движение.СуммаРуб = ОборудованиеDSS.Итог("СуммаРуб");
		Движение.Количество = 0;
		Возврат;
	КонецЕсли;
	
	//Reclass FA to MnS
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.ReclassFAtoMnS Тогда
		Для Каждого СтрокаТЧ Из ОборудованиеDSS Цикл
			Движение = Движения.ОборудованиеDSS.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
			Движение.Период = Дата;
			
			Движение = Движения.MaterialsAndSupplies.ДобавитьПриход();
			Движение.ПроводкаДеталейСКП = СтрокаТЧ.ПроводкаДеталейСКП;
			Движение.FiscalSum = СтрокаТЧ.СуммаРуб;
			Движение.ManagementSum = СтрокаТЧ.Сумма;
			Движение.Период = Дата;
		КонецЦикла;
	Возврат;	
	КонецЕсли;
	
	//Добавила Федотова Л., РГ-Софт, 24.05.13, вопрос SLI-0003596	                    
	//Reclass FA to CoGS
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.ReclassFAtoCoS Тогда
		Для Каждого СтрокаТЧ Из ОборудованиеDSS Цикл
			Движение = Движения.ОборудованиеDSS.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
			Движение.Период = Дата;
			
			Движение = Движения.CoGS.ДобавитьПриход();
			Движение.СписаниеОборудования = Ссылка;
			Движение.ПроводкаДеталейСКП = СтрокаТЧ.ПроводкаДеталейСКП;
			Движение.Номенклатура = СтрокаТЧ.Номенклатура;
			Движение.Количество = СтрокаТЧ.Количество;
			Движение.FiscalSum = СтрокаТЧ.СуммаРуб;
			Движение.ManagementSum = СтрокаТЧ.Сумма;
			Движение.Период = Дата;
		КонецЦикла;
	Возврат;	
	КонецЕсли;
	
	//Ввод остатков
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.ВводОстатков Тогда
		Для Каждого СтрокаТЧ Из ОборудованиеDSS Цикл
			Движение = Движения.ОборудованиеDSS.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
			Движение.Период = Дата;
		КонецЦикла;
	Возврат;	
	КонецЕсли;
               	
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ОборудованиеЛокальное.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.НомерНакладной = ТекСтрокаСостав.НомерНакладной;
		Движение.Поставщик = ТекСтрокаСостав.Поставщик;
		Движение.AU = ТекСтрокаСостав.AU;
		Движение.РО = ТекСтрокаСостав.РО;
		Движение.ДатаНакладной = ТекСтрокаСостав.ДатаНакладной;
		Движение.Подразделение = ТекСтрокаСостав.Подразделение;
		Движение.Сумма = ТекСтрокаСостав.Сумма;
	КонецЦикла;
	
	Для Каждого ТекСтрокаДекларации Из Декларации Цикл
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.Оборудование Тогда
			Движение = Движения.Оборудование.Добавить();
			Движение.Сумма = ТекСтрокаДекларации.Сумма;
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.ОборудованиеЭкспортное Тогда
			Движение = Движения.ОборудованиеЭкспорт.Добавить();
		КонецЕсли; 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Декларация = ТекСтрокаДекларации.Декларация;
		Движение.Номенклатура = ТекСтрокаДекларации.Номенклатура;
		Движение.AU = ТекСтрокаДекларации.AccountingUnit;
		Движение.НомерСтрокиГТД = ТекСтрокаДекларации.НомерСтрокиГТД;
		Движение.Количество = ТекСтрокаДекларации.Количество;
	КонецЦикла;
	   	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Контрагент = "";
	РО = "";
	Контрагенты = Состав.Выгрузить();
	Контрагенты.Свернуть("Поставщик");
	Для каждого стр из Контрагенты цикл
		Контрагент = Контрагент + стр.Поставщик + " ";
	КонецЦикла;
	РОы = Состав.Выгрузить();
	РОы.Свернуть("РО");
	Для каждого стр из РОы цикл
		РО = РО + стр.РО + " ";
	КонецЦикла;
	
	//Добавил РГ-Софт - Пронин Иван
	мУдалятьДвижения = НЕ ЭтоНовый();
	//Конец добавления
КонецПроцедуры

//Добавил РГ-Софт - Пронин Иван
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда 
		//ВидОперации = Перечисления.ВидыОперацийСписаниеОборудования.ReclassFAtoMnS;
		НастройкаПравДоступа.УстановитьДатуПроведенияДокумента(ЭтотОбъект);
	    НастройкаПравДоступа.УстановитьНалоговыйПериодДокумента(ЭтотОбъект);
		Для Каждого СтрокаТаблицы из ДанныеЗаполнения Цикл 
			НоваяСтр = ОборудованиеDSS.Добавить();
			НоваяСтр.ПроводкаДеталейСКП = СтрокаТаблицы.ПроводкаDSSДеталейСчетовКнигиПокупок;
			ЗаполнитьЗначенияСвойств(НоваяСтр,СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
